app/views/welcome/_header.html.erb

        <% @type = current_user.user_type
             if @type == 'professor' and not Professor.find_by_user_id(current_user.id).nil?%>
            <span class="navbar-brand mb-0 h1">Professor: <%= Professor.find_by_user_id(current_user.id).name %></span>
          <% elsif @type == 'student' and not Student.find_by_user_id(current_user.id).nil? %>
            <span class="navbar-brand mb-0 h1">Student: <%= Student.find_by_user_id(current_user.id).name %></span>
---
SELECT "professors".* FROM "professors" WHERE "professors"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]