app/views/professors/show.html.erb

SELECT "tri_professor_course_students".* FROM "tri_professor_course_students"
SELECT "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <% @course_names = Set[] %>
  <% @relations = TriProfessorCourseStudent.all %>
  <% @relations.each do |relation| %>
    <% if relation.professor_user_id == @professor.id and not @course_names.include?(Course.find_by_id(relation.course_name).name)%>
      <%= Course.find_by_id(relation.course_name).name %>
      <% @course_names.add(Course.find_by_id(relation.course_name).name) %>
      <p>
        <%= link_to "Show this course", Course.find_by_id(relation.course_name) %>