app/views/tri_professor_course_students/_form.html.erb

    <%= form.label :professor_user_id, style: "display: block" %>
    <%= form.select :professor_user_id,
                    options_for_select(Professor.all.pluck(:firstName, :lastName, :oib, :id).map { |firstName, lastName, oib, id| ["#{firstName} #{lastName}, OIB:#{oib}",id ]}),
                    {prompt:'Select professor'},
                    disabled: if current_user.user_type== 'professor' then true else false end %>
---
SELECT "professors"."user_id", "professors"."firstName", "professors"."lastName", "oib" FROM "professors"

    <%= form.label :course_name, style: "display: block" %>
    <%= form.select :course_name, options_for_select(Course.all.pluck(:name, :id)),{prompt:'Select course'},
                    disabled: if current_user.user_type== 'professor' then true else false end %>
---
SELECT "courses"."name", "courses"."id" FROM "courses"

    <%= form.label :student_user_id, style: "display: block" %>
    <%= form.select :student_user_id,
                    options_for_select(Student.all.pluck(:firstName, :lastName, :jmbag, :id).map { |firstName, lastName, jmbag, id| ["#{firstName} #{lastName}, JMBAG:#{jmbag}", id]}),
                    {prompt:'Select student'},
                    disabled: if current_user.user_type== 'professor' then true else false end %>
---
SELECT "students"."firstName", "students"."lastName", "jmbag", "students"."id" FROM "students"