app/views/tri_professor_course_students/_tri_professor_course_student.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    <strong>Professor:</strong>
    <% @professor = Professor.find_by_id(tri_professor_course_student.professor_user_id) %>

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <strong>Course name:</strong>
    <% @course = Course.find_by_id(tri_professor_course_student.course_name) %>

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    <strong>Student:</strong>
    <% @student = Student.find_by_id(tri_professor_course_student.student_user_id) %>