app/views/tri_professor_course_students/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "professors".* FROM "professors" WHERE "professors"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]
---
        <tbody>
      <% @tri_professor_course_students.sort { |a,b| Professor.find_by_id(a.professor_user_id).name <=> Professor.find_by_id(b.professor_user_id).name }
             .each_with_index do |tri_professor_course_student, index| tri_professor_course_student %>

SELECT "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
        <td> <%= index+1 %> </td>
        <td> <%= link_to Professor.find_by_id(tri_professor_course_student.professor_user_id).name, professor_path(tri_professor_course_student.professor_user_id) %> </td>
        <td> <%= link_to Course.find_by_id(tri_professor_course_student.course_name).name, course_path(tri_professor_course_student.course_name) %> </td>
        <td> <%= link_to Student.find_by_id(tri_professor_course_student.student_user_id).name, student_path(tri_professor_course_student.student_user_id) %> </td>

SELECT "professors".* FROM "professors" WHERE "professors"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]
---
        @courses = Set[]
        @this_professor = Professor.find_by_user_id(current_user.id)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <% @courses.each do |course_id| %>
        <h3><%= Course.find_by_id(course_id).name %></h3>

SELECT "professors".* FROM "professors" WHERE "professors"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
            <% @tri_professor_course_students.each_with_index do |tri_professor_course_student, index| tri_professor_course_student  %>
            <%if tri_professor_course_student.professor_user_id == Professor.find_by_user_id(current_user.id).id and tri_professor_course_student.course_name == course_id%>
              <td> <%= index+1 %> </td>
              <td> <%= link_to Student.find_by_id(tri_professor_course_student.student_user_id).name, student_path(tri_professor_course_student.student_user_id) %> </td>

SELECT "students".* FROM "students" WHERE "students"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
        <% @tri_professor_course_students.each_with_index do |tri_professor_course_student, index| tri_professor_course_student  %>
          <%if tri_professor_course_student.student_user_id == Student.find_by_user_id(current_user.id).id %>
            <td> <%= index+1 %> </td>
            <td> <%= link_to Course.find_by_id(tri_professor_course_student.course_name).name, course_path(tri_professor_course_student.course_name) %> </td>
            <td> <%= link_to Professor.find_by_id(tri_professor_course_student.professor_user_id).name, professor_path(tri_professor_course_student.professor_user_id) %> </td>