app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "course_type", "semester", "ECTS", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Matematička analiza 1"], ["course_type", "obavezni"], ["semester", 1], ["ECTS", 7], ["created_at", "2022-04-13 08:35:55.860046"], ["updated_at", "2022-04-13 08:35:55.860046"]]