app/controllers/professors_controller.rb

SELECT "professors".* FROM "professors"
---
  def index
    @professors = Professor.all

INSERT INTO "professors" ("firstName", "lastName", "DOB", "OIB", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "professors" SET "lastName" = ?, "updated_at" = ? WHERE "professors"."id" = ?  [["lastName", "Perković2"], ["updated_at", "2022-04-01 15:53:36.598686"], ["id", 2]]
---
  def create
    #@professor = Professor.new(professor_params)
    @professor = current_user.build_professor(professor_params)

    respond_to do |format|
      if @professor.save

UPDATE "professors" SET "lastName" = ?, "updated_at" = ? WHERE "professors"."id" = ?  [["lastName", "Perković2"], ["updated_at", "2022-04-01 15:53:36.598686"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @professor.update(professor_params)

DELETE FROM "professors" WHERE "professors"."id" = ?  [["id", 11]]
---
  def destroy
    @professor.destroy

SELECT "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_professor
      @professor = Professor.find(params[:id])