app/controllers/students_controller.rb

  def create
    #@student = Student.new(student_params)
    @student = current_user.build_student(student_params)
    respond_to do |format|
      if @student.save
---
UPDATE "students" SET "firstName" = ?, "lastName" = ?, "JMBAG" = ?, "DOB" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["firstName", "Karla"], ["lastName", "Kolić"], ["JMBAG", "1234567890"], ["DOB", "2000-12-11"], ["updated_at", "2022-03-29 10:25:11.471237"], ["id", 2]]
INSERT INTO "students" ("firstName", "lastName", "JMBAG", "DOB", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "firstName" = ?, "updated_at" = ?, "user_id" = ? WHERE "students"."id" = ?  [["firstName", "LukaTest"], ["updated_at", "2022-04-14 11:22:00.237164"], ["user_id", 11], ["id", 8]]

  def destroy
    @student.destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 12]]