app/controllers/tri_professor_course_students_controller.rb

  def index
    @tri_professor_course_students = TriProfessorCourseStudent.all
---
SELECT "tri_professor_course_students".* FROM "tri_professor_course_students"

  def create
    @tri_professor_course_student = TriProfessorCourseStudent.new(tri_professor_course_student_params)

    respond_to do |format|
      if @tri_professor_course_student.save
---
INSERT INTO "tri_professor_course_students" ("professor_user_id", "course_name", "student_user_id", "created_at", "updated_at", "grade") VALUES (?, ?, ?, ?, ?, ?)  [["professor_user_id", 6], ["course_name", "4"], ["student_user_id", 11], ["created_at", "2022-04-13 19:22:29.440392"], ["updated_at", "2022-04-13 19:22:29.440392"], ["grade", 0]]

  def update
    respond_to do |format|
      if @tri_professor_course_student.update(tri_professor_course_student_params)
---
UPDATE "tri_professor_course_students" SET "updated_at" = ?, "grade" = ? WHERE "tri_professor_course_students"."id" = ?  [["updated_at", "2022-04-13 19:24:38.496589"], ["grade", 2], ["id", 3]]

  def destroy
    @tri_professor_course_student.destroy
---
DELETE FROM "tri_professor_course_students" WHERE "tri_professor_course_students"."id" = ?  [["id", 7]]

    def set_tri_professor_course_student
      @tri_professor_course_student = TriProfessorCourseStudent.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "tri_professor_course_students".* FROM "tri_professor_course_students" WHERE "tri_professor_course_students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]